In [12]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [18]:
%sql postgresql://postgres:postgres@localhost:5432/NGC5

In [19]:
%sql select * from Customers

 * postgresql://postgres:***@localhost:5432/NGC5
   postgresql://postgres:***@localhost:5432/w2d2pm
3 rows affected.

[(1, 'John Doe', 'New York'),
 (2, 'Jane Smith', 'Los Angeles'),
 (3, 'David Johnson', 'Chicago')]

In [20]:
%sql select * from Orders

 * postgresql://postgres:***@localhost:5432/NGC5
   postgresql://postgres:***@localhost:5432/w2d2pm
4 rows affected.

[(1, 1, datetime.date(2022, 1, 10), Decimal('100.00')),
 (2, 1, datetime.date(2022, 2, 15), Decimal('150.00')),
 (3, 2, datetime.date(2022, 3, 20), Decimal('200.00')),
 (4, 3, datetime.date(2022, 4, 25), Decimal('50.00'))]

In [24]:
%%sql 
select customer_name, count(total_amount) as total_order
from Customers as c
inner join Orders as o on c.customer_id = o.customer_id
group by customer_name
order by customer_name desc;

 * postgresql://postgres:***@localhost:5432/NGC5
   postgresql://postgres:***@localhost:5432/w2d2pm
3 rows affected.

[('John Doe', 2), ('Jane Smith', 1), ('David Johnson', 1)]